# Taps
tap "homebrew/cask-fonts"
tap "clojure/tools"

# Developer Tools
brew "git"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "clojure/tools/clojure"
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "tree"
brew "mas"
brew "coreutils"
brew "findutils"
brew "bash"
brew "wget"
brew "diff-so-fancy"
brew "python3"
brew "duti"
brew "yarn"
brew "tmux"
brew "gh"
brew "jenv"

# Ruby - kamal
brew "ruby-install"
brew "chruby"

# C
brew "ccls"
brew "clang-format"

# nvim
brew "neovim"
brew "fd"
brew "ripgrep"
cask "font-meslo-lg-nerd-font"

# Install casks items (apps, fonts etc)
cask "google-chrome"
cask "firefox"
cask "slack"
cask "dropbox"
cask "vlc"
