# Taps
tap "caskroom/cask"
tap "homebrew/bundle"
tap "cask-fonts"

# Developer Tools
brew "git"
brew "tree"
brew "zsh"
brew "mas"
brew "zsh-completions"
brew "coreutils"
brew "findutils"
brew "bash"
brew "wget"
brew "diff-so-fancy"
brew "python3"
brew "watchman"
brew "rbenv"
brew "duti"
brew "yarn"
brew "tmux"
brew "gh"

# Install casks items (apps, fonts etc)
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "slack"
cask "dropbox"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "atom"
cask "vagrant-manager"
cask "postman"
cask "font-meslo-lg-nerd-font"

# Apps - https://github.com/mas-cli/mas
mas "Sip", id: 507257563
