# Taps
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "clojure/tools"

# Developer Tools
brew "git"
brew "clojure/tools/clojure"
brew "tree"
brew "zsh"
brew "mas"
brew "zsh-completions"
brew "coreutils"
brew "findutils"
brew "bash"
brew "wget"
brew "diff-so-fancy"
brew "python3"
brew "duti"
brew "yarn"
brew "tmux"
brew "gh"
brew "jenv"
brew "neovim"
brew "font-meslo-lg-nerd-font"

# Install casks items (apps, fonts etc)
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "slack"
cask "dropbox"
cask "vagrant"
cask "virtualbox-extension-pack"
cask "virtualbox"
cask "vlc"
cask "atom"
cask "vagrant-manager"
